INSERT INTO employees (name, surname, passport_number, passport_date, salary)
VALUES
    ('Иван', 'Иванов', '005201', '1990-01-01', 100000),
    ('Петр', 'Петров', '005202', '1991-02-02', 80000),
    ('Алексей', 'Сидоров', '005203', '1992-03-03', 120000),
    ('Мария', 'Смирнова', '005204', '1993-04-04', 90000),
    ('Елена', 'Кузнецова', '005205', '1994-05-05', 110000),
    ('Дмитрий', 'Зайцев', '034830', '1995-06-06', 95000),
    ('Анна', 'Васильева', '034831', '1996-07-07', 105000),
    ('Сергей', 'Павлов', '034832', '1997-08-08', 85000),
    ('Ольга', 'Семенова', '034833', '1998-09-09', 115000),
    ('Николай', 'Петрович', '034834', '1999-10-10', 100000),
    ('Татьяна', 'Виноградова', '034835', '2000-11-11', 95000),
    ('Александр', 'Белов', '005206', '2001-12-12', 115000),
    ('Юлия', 'Денисова', '005207', '2002-01-01', 90000),
    ('Игорь', 'Козлов', '005208', '2003-02-02', 105000),
    ('Екатерина', 'Лебедева', '005209', '2004-03-03', 85000),
    ('Максим', 'Новиков', '005210', '2005-04-04', 110000),
    ('Светлана', 'Морозова', '005211', '2006-05-05', 95000),
    ('Павел', 'Иванович', '005212', '2007-06-06', 115000),
    ('Марина', 'Соловьева', '005213', '2008-07-07', 100000),
    ('Роман', 'Тимофеев', '005214', '2009-08-08', 95000);

INSERT INTO departments (name, city, street, region, postal_code, phone_number)
VALUES
    ('IT', 'Воронеж', 'Улица Пушкина', 'Воронежская область', '394006', '+7(473)111-11-11'),
    ('Маркетинг', 'Воронеж', 'Улица Гоголя', 'Воронежская область', '394007', '+7(473)222-22-22'),
    ('QA', 'Воронеж', 'Улица Чехова', 'Воронежская область', '394008', '+7(473)333-33-33'),
    ('HR', 'Воронеж', 'Улица Тургенева', 'Воронежская область', '394009', '+7(473)444-44-44'),
    ('Бухгалтерия', 'Воронеж', 'Улица Достоевского', 'Воронежская область', '394010', '+7(473)555-55-55');

INSERT INTO employees_departments (employee_id, department_id)
VALUES
    (1, 1), (2, 2), (3, 3), (4, 4), (5, 5),
    (6, 1), (7, 2), (8, 3), (9, 4), (10, 5),
    (11, 1), (12, 2), (13, 3), (14, 4), (15, 5),
    (16, 1), (17, 2), (18, 3), (19, 4), (20, 5);
